{
    "species": "Amelanchier arborea",
    "link": "https://en.wikipedia.org/wiki/Amelanchier_arborea",
    "introduction": "Amelanchier arborea (downy serviceberry[3] or common serviceberry[4]), is native to eastern North America from the Gulf Coast north to Thunder Bay in Ontario and Lake St. John in Quebec, and west to Texas and Minnesota.[3]\n\nOther common names are \"shadberries\" (as their blossoming coincides with the shad runs in New England), \"Juneberries\" (because the berries usually set on in June), and \"Service\" or \"Sarvice\" berries because their blooms mean that the muddy back roads into the \"coves and hollers\" of Appalachia will soon be passable for circuit-riding preachers and the communities will be able to have Sunday services again. (Some say, more morbidly, that it means the ground is soft enough to dig, which means that those who died over winter can be buried and have services said over them.)[citation needed]\n\nAmelanchier arborea is generally 512 m (1639 ft) tall. Occasionally, it can grow up to 20 metres (66 ft) tall and reach into the overstory. The trunk can be up to 15 cm (6 in) in diameter (rarely to 40 cm or 16 in). The bark is smooth and gray.[5][6]\n\nThe buds are slender with a pointed tip, and usually more than two scales visible. The leaves are ovate or elliptical, 48 cm (1+1⁄23+1⁄4 in), rarely 10 cm (4 in), long and 2.54 cm (11+5⁄8 in) wide, with pointed tips and finely serrated margins. A characteristic useful for identification is that the young leaves emerge downy on the underside. The fall color is variable, from orange-yellow to pinkish or reddish.[5][6]\n\nIt has perfect flowers that are 1525 mm (5⁄81 in) in diameter, with 5 petals, emerging during budbreak in early spring. The petals are white. Flowers are produced on pendulous racemes 35 cm (1+1⁄42 in) long with 410 flowers on each raceme. The flowers are pollinated by bees. The fruit is a reddish-purple pome, resembling a small apple in shape. They ripen in summer and are very popular with birds.[5][6][7] The fruit is eaten by over 40 species of birds and various mammals, including squirrels, rabbits, chipmunks, mice, voles, foxes, black bears, deer, and elk. [4]\n\nIt also commonly hybridizes with other species of Amelanchier,[6] the hybrid Amelanchier × grandiflora being one example,[8] and identification can be very difficult as a result.\n\nThis species tolerates varying light levels, but is at its best in full sun. It requires good drainage and air circulation and should be watered during drought.[original research?] It is often confused with other species[which?] in the nursery trade.[citation needed] Propagation is by seed, divisions and grafting.\n\nThe edible fruit[9] is drier than some other serviceberries, and it is harvested locally for pies and jams, and has been known to be used for wine; they were also used by Native Americans to make bread.[citation needed]\n\nSome report that the sweetened juice tastes like Dr. Pepper and some nurseries sell them as \"The Dr. Pepper Tree\", but the fruit is not used in the soft drink.",
    "description": ""
}