{
    "species": "Phytolacca americana",
    "link": "https://en.wikipedia.org/wiki/Phytolacca_americana",
    "introduction": "Phytolacca americana, also known as American pokeweed, pokeweed, poke sallet, pokeberry, dragonberries, pigeonberry weed, and inkberry, is a poisonous, herbaceous perennial plant in the pokeweed family Phytolaccaceae. This pokeweed grows 1 to 3 metres (4 to 10 ft).[4] It has simple leaves on green to red or purplish stems and a large white taproot. The flowers are green to white, followed by berries which ripen through red to purple to almost black which are a food source for songbirds such as gray catbird, northern mockingbird, northern cardinal, and brown thrasher, as well as other birds and some small non-avian animals (i.e., for species that are unaffected by its mammalian toxins).\n\nPokeweed is native to eastern North America, the Midwest, and the South, with more scattered populations in the far West where it was introduced.[5] It is also naturalized in parts of Europe and Asia. It is considered a pest species by farmers.[6] Pokeweed is poisonous to humans, dogs, and livestock. In spring and early summer, shoots and leaves (not the root) are edible with proper cooking (hence the common name \"poke sallet\"),[7] but later in the summer they become deadly, and the berries are also poisonous. It is used as an ornamental in horticulture, and it provokes interest for the variety of its natural products (toxins and other classes), for its ecological role, its historical role in traditional medicine, and for some utility in biomedical research (e.g., in studies of pokeweed mitogen). In the wild, it is easily found growing in pastures, recently cleared areas, and woodland openings, edge habitats such as along fencerows, and in wastelands.\n\nThe first word in its scientific name, Phytolacca americana, comes from the Greek words phyton ('plant') and lacca—the scarlet dye secreted by the Kerria lacca scale insect. The second denotes this plant as native to America. The common name \"poke\" is derived from puccoon, pocan, or poughkone (from an Algonquin name for the plant).[8] Its berries were once used to make ink, hence its other sometimes-used common name, inkberry.",
    "description": ""
}