{
    "species": "Taraxacum",
    "link": "https://en.wikipedia.org/wiki/Taraxacum",
    "introduction": "Taraxacum (/təˈræksəkəm/)[3] is a large genus of flowering plants in the family Asteraceae, which consists of species commonly known as dandelions. The scientific and hobby study of the genus is known as taraxacology.[4] The genus is native to Eurasia but the two most commonplace species worldwide, T. officinale (the common dandelion) and T. erythrospermum (the red-seeded dandelion), were introduced from Europe into North America, where they are an invasive species.[5] Dandelions thrive in temperate regions and can be found in yards, gardens, sides of roads, among crops, and in many other habitats.[6] Both species are edible in their entirety[a] and have a long history of consumption.[7] The common name dandelion (/ˈdændəlaɪ.ən/ DAN-də-ly-ən; from French dent-de-lion 'lion's tooth', referring to the jagged leaves) is also given to specific members of the genus.[8]\n\nLike other members of the family Asteraceae, they have very small flowers collected together into a composite flower head. Each single flower in a head is called a floret. In part due to their abundance, along with being a generalist species, dandelions are one of the most vital early spring nectar sources for a wide host of pollinators.[9] Many Taraxacum species produce seeds asexually by apomixis, where the seeds are produced without pollination, resulting in offspring that are genetically identical to the parent plant.[10]\n\nIn general, the leaves are 525 centimetres (2.09.8 in) long or longer, simple, lobed-to-pinnatisect, and form a basal rosette above the central taproot. The flower heads are yellow to orange coloured, and are open in the daytime, but closed at night. The heads are borne singly on a hollow stem (scape) that is usually leafless and rises 110 centimetres (0.43.9 in) or more[5] above the leaves. Stems and leaves exude a white, milky latex when broken. A rosette may produce several flowering stems at a time. The flower heads are 25 centimetres (0.82.0 in) in diameter and consist entirely of ray florets. The flower heads mature into spherical seed heads sometimes called blowballs[11] or clocks (in both British and American English)[12][13][14][15] containing many single-seeded fruits called cypselae, similar to achenes. Each cypsela is attached to a pappus of fine hair-like material which enables anemochorous (wind-aided) dispersal over long distances.[16]\n\nThe flower head is surrounded by bracts (sometimes mistakenly called sepals) in two series. The inner bracts are erect until the seeds mature, then flex downward to allow the seeds to disperse. The outer bracts are often reflexed downward, but remain appressed in plants of the sections Palustria and Spectabilia. Between the pappus and the achene is a stalk called a beak, which elongates as the fruit matures. The beak breaks off from the achene quite easily, separating the seed from the parachute.[17]",
    "description": ""
}