{
    "species": "Allium",
    "link": "https://en.wikipedia.org/wiki/Allium",
    "introduction": "Allium is a large genus of monocotyledonous flowering plants with around 1000 accepted species,[4][5] making Allium the largest genus in the family Amaryllidaceae and amongst the largest plant genera in the world.[6] Many of the species are edible, and some have a long history of cultivation and human consumption as a vegetable including the onion, garlic, scallions, shallots, leeks, and chives, with onions being the second most grown vegetable globally after tomatoes as of 2023.[7][8]\n\nAllium species occur in temperate climates of the Northern Hemisphere, except for a few species occurring in Chile (such as A. juncifolium), Brazil (A. sellovianum), and tropical Africa (A. spathaceum). They vary in height between 5150 centimetres (259 in). The flowers form an umbel at the top of a leafless stalk. The bulbs vary in size between species, from small (around 23 mm in diameter) to rather large (810 cm). Some species (such as Welsh onion A. fistulosum and leeks (A. ampeloprasum)) develop thickened leaf-bases rather than forming bulbs as such.\n\nCarl Linnaeus first described the genus Allium in 1753. The generic name Allium is the Latin word for garlic,[9][10] and the type species for the genus is Allium sativum which means \"cultivated garlic\".[11] The decision to include a species in the genus Allium is taxonomically difficult, and species boundaries are unclear. Estimates of the number of species are as low as 260,[12] and as high as 979.[13] In the APG III classification system, Allium is placed in the family Amaryllidaceae, subfamily Allioideae (formerly the family Alliaceae).[14] In some of the older classification systems, Allium was placed in Liliaceae.[15][16][17][18][19] Molecular phylogenetic studies have shown this circumscription of Liliaceae is not monophyletic.\n\nVarious Allium species have been cultivated from the earliest times. About a dozen species are economically important as crops, or garden vegetables, and an increasing number of species are important as ornamental plants.[15][16] Plants of the genus produce chemical compounds, mostly derived from cysteine sulfoxides, that give them a characteristic onion or garlic taste and odor.[15] Many are used as food plants, though not all members of the genus are equally flavorful. In most cases, both bulb and leaves are edible. The characteristic Allium flavor depends on the sulfate content of the soil the plant grows in.[15] In the rare occurrence of sulfur-free growth conditions, all Allium species completely lose their usual pungency.",
    "description": "The genus Allium (alliums) is characterised by herbaceous geophyte perennials with true bulbs, some of which are borne on rhizomes, and an onion or garlic odor and flavor.[20]\n\nThe bulbs are solitary or clustered and tunicate and the plants are perennialized by the bulbs reforming annually from the base of the old bulbs, or are produced on the ends of rhizomes or, in a few species, at the ends of stolons.[21] A small number of species have tuberous roots. The bulbs' outer coats are commonly brown or grey, with a smooth texture, and are fibrous, or with cellular reticulation. The inner coats of the bulbs are membranous.\n\nMany alliums have basal leaves that commonly wither away from the tips downward before or while the plants flower, but some species have persistent foliage. Plants produce from one to 12 leaves, most species having linear, channeled or flat leaf blades. The leaf blades are straight or variously coiled, but some species have broad leaves, including A. victorialis and A. tricoccum. The leaves are sessile, and very rarely narrowed into a petiole.\n\nThe flowers, which are produced on scapes are erect or in some species pendent, having six petal-like tepals produced in two whorls. The flowers have one style and six epipetalous stamens; the anthers and pollen can vary in color depending on the species. The ovaries are superior, and three-lobed with three locules.\n\nThe fruits are capsules that open longitudinally along the capsule wall between the partitions of the locule.[21][22] The seeds are black, and have a rounded shape.\n\nThe terete or flattened flowering scapes are normally persistent. The inflorescences are umbels, in which the outside flowers bloom first and flowering progresses to the inside. Some species produce bulbils within the umbels, and in some species, such as Allium paradoxum, the bulbils replace some or all the flowers. The umbels are subtended by noticeable spathe bracts, which are commonly fused and normally have around three veins.\n\nSome bulbous alliums increase by forming little bulbs or \"offsets\" around the old one, as well as by seed. Several species can form many bulbils in the flowerhead; in the so-called \"tree onion\" or Egyptian onion (A. × proliferum) the bulbils are few, but large enough to be pickled.\n\nMany of the species of Allium have been used as food items throughout their ranges. There are several unrelated species that are somewhat similar in appearance to Alliums but are poisonous (e.g. in North America, death camas, Toxicoscordion venenosum), but none of these has the distinctive scent of onions or garlic.[23][24]"
}